#  やりたいこと-----------------
# GoogleColabからBigQueryにデータをインポートする
# --------------------------------

# 実施手順---------------------
# 1.GCPアカウントでログイン燃焼
# 2.dfをBigQueryにインポート
# ------------------------------

# 更新履歴---------------------
# 2021/03/14 初版作成(杉元)
# ------------------------------

# 実施手順---------------------
# 1.GCPアカウントでログイン燃焼
# ------------------------------
from google.colab import auth
auth.authenticate_user()


# 実施手順---------------------
# 2.dfをBigQueryにインポート
# ------------------------------
df.to_gbq({bq_dataset}.{bq_table}, {PROJECT_ID},if_exists='append')
